sides = int(input("ВВЕДИТЕ КОЛИЧЕСТВО СТОРОН: "))
if sides == 3:
    print("ТРИ СТОРОНЫ?! ЭТО ТРЕУГОЛЬНИК!!!")
elif sides == 4:
    print("ЧЕТЫРЕ СТОРОНЫ?! ЭТОЛИ КВАДРАТ, ИЛИ ПРЯМОУГОЛЬНИК!!!")
elif sides == 5:
    print("ПЯТЬ СТОРОН?! ЭТО ПЯТИУГОЛЬНИК!!!")
elif sides == 6:
    print("ШЕСТЬ СТОРОН?! ЭТО ШЕСТИУГОЛЬНИК!!!")
elif sides == 7:
    print("СЕМЬ СТОРОН?! ЭТО СЕМИУГОЛЬНИК!!!")
elif sides == 8:
    print("ВОСЕМЬ СТОРОН?! ЭТО ВОСЬМИУГОЛЬНИК!!!")
elif sides == 9:
    print("ДЕВЯТЬ СТОРОН?! ЭТО ДЕВЯТИУГОЛЬНИК!!!")
elif sides == 10:
    print("ДЕСЯТЬ СТОРОН?! ЭТО ДЕСЯТИУГОЛЬНИК!!!")
else: 
    print("ВЫ ВВЕЛИ НЕПРАВИЛЬНОЕ ЧИСЛО!!! ПОПРОБУЙТЕ ЕЩЕ РАЗ!!!")    