ZODIAC_SIGNS = {
    "Козерог": [(1, 1), (1, 20)],
    "Водолей": [(1, 21), (2, 18)],
    "Рыбы": [(2, 19), (3, 20)],
    "Овен": [(3, 21), (4, 19)],
    "Телец": [(4, 20), (5, 20)],
    "Близнецы": [(5, 21), (6, 20)],
    "Рак": [(6, 21), (7, 22)],
    "Лев": [(7, 23), (8, 22)],
    "Дева": [(8, 23), (9, 22)],
    "Весы": [(9, 23), (10, 22)],
    "Скорпион": [(10, 23), (11, 21)],
    "Стрелец": [(11, 22), (12, 21)],
    "Козерог": [(12, 22), (12, 31)]
}
MONTHS = {
    "январь": 1,
    "февраль": 2,
    "март": 3,
    "апрель": 4,
    "май": 5,
    "июнь": 6,
    "июль": 7,
    "август": 8,
    "сентябрь": 9,
    "октябрь": 10,
    "ноябрь": 11,
    "декабрь": 12
}

print("Введите вашу дату рождения в формате 'день месяц' (например, '15 март'):")
birth_date = input().strip().lower()

day, month_name = birth_date.split()
day = int(day)

if month_name in MONTHS:
    month = MONTHS[month_name]
else:
    print("Ошибка: неверное название месяца.")
    exit()

if month == 2 and (day > 29):
    print("Ошибка: неверная дата рождения. В феврале максимум 29 дней.")
    exit()
elif month in [4, 6, 9, 11] and (day > 30):
    print("Ошибка: неверная дата рождения. В этом месяце максимум 30 дней.")
    exit()
elif day < 1 or day > 31:
    print("Ошибка: неверная дата рождения.")
    exit()

zodiac_sign = None
for sign, dates in ZODIAC_SIGNS.items():
    if (month == dates[0][0] and day >= dates[0][1]) or (month == dates[1][0] and day <= dates[1][1]):
        zodiac_sign = sign
        break #Херово тут не должен быть break

if zodiac_sign:
    print(f"Ваш знак зодиака: {zodiac_sign}.")
else:
    print("Ошибка: неверная дата рождения.")